nghiluu-engr/STM32F103C8T6_exercises/LED_PROJECT/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_1_BLUE_Pin GPIO_PIN_1
#define LED_1_BLUE_GPIO_Port GPIOA
#define LED_1_GREEN_Pin GPIO_PIN_2
#define LED_1_GREEN_GPIO_Port GPIOA
#define LED_1_RED_Pin GPIO_PIN_3
#define LED_1_RED_GPIO_Port GPIOA
#define LED_2_BLUE_Pin GPIO_PIN_5
#define LED_2_BLUE_GPIO_Port GPIOA
#define LED_2_GREEN_Pin GPIO_PIN_6
#define LED_2_GREEN_GPIO_Port GPIOA
#define LED_2_RED_Pin GPIO_PIN_7
#define LED_2_RED_GPIO_Port GPIOA
#define BUTTON_Pin GPIO_PIN_11
#define BUTTON_GPIO_Port GPIOB
#define LED_3_RED_Pin GPIO_PIN_12
#define LED_3_RED_GPIO_Port GPIOB
#define LED_3_GREEN_Pin GPIO_PIN_13
#define LED_3_GREEN_GPIO_Port GPIOB
#define LED_3_BLUE_Pin GPIO_PIN_14
#define LED_3_BLUE_GPIO_Port GPIOB
#define LED_4_BLUE_Pin GPIO_PIN_10
#define LED_4_BLUE_GPIO_Port GPIOA
#define LED_4_GREEN_Pin GPIO_PIN_11
#define LED_4_GREEN_GPIO_Port GPIOA
#define LED_4_RED_Pin GPIO_PIN_12
#define LED_4_RED_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
